cf/DataProcessors/нсиУдалениеВерсийОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<DataProcessor>
		<Properties>
			<Name>нсиУдалениеВерсийОбъектов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСправочника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

cf/InformationRegisters/ВерсииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<InformationRegister>
		<Properties>
			<Name>ВерсииОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВерсияОбъекта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвторВерсии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВнешниеПользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВерсии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВерсииОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВерсийОбъекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПроигнорирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрольнаяСумма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьДанныеВерсии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияВладелец</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Узел</Name>
					<Comment>Технический реквизит, используется при выгрузке данных в РИБ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синхронизируется</Name>
					<Comment>Технический реквизит, используется при выгрузке данных в РИБ</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Смещение</Name>
					<Comment>Технический реквизит, используется при выгрузке данных в РИБ</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf/DataProcessors/нсиУдалениеВерсийОбъектов/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяСправочникаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СписокЗн = ПолучитьСписокСправочников();
	
	ВыбЭлемент = СписокЗн.ВыбратьЭлемент();
	Если не ВыбЭлемент = Неопределено Тогда
		Объект.ИмяСправочника = ВыбЭлемент.Значение;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоСправочникуПриИзменении(Элемент)
	Если ПоСправочнику Тогда
		Элементы.ИмяСправочника.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.ИмяСправочника.ТолькоПросмотр = Истина;
		Объект.ИмяСправочника = "";
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьУдаление(Команда)
	
	Если ПоСправочнику и не ЗначениеЗаполнено(Объект.ИмяСправочника) ТОгда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан справочник!",, "Объект.ИмяСправочника");
		Возврат;
	КонецЕсли;
	
	КолЭлементов = ПолучитьКоличествоУдаляемыхЭлементов();
	
	Если КолЭлементов>0 Тогда 
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "ru = 'Операция необратима, будет удалено " + Строка(КолЭлементов) + " элементов! Продолжить выполнение операции?'";
		ОписаниеОповещения = новый ОписаниеОповещения("ОбработкаОтветаВыполнитьУдаление",ЭтаФорма);
		ПоказатьВопрос(ОписаниеОповещения,НСтр(Текст), Режим, 0);
	Иначе
		ПоказатьПредупреждение(,НСтр("ru = 'Нет элементов для удаления!'"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОтветаВыполнитьУдаление(Результат,ДП) Экспорт
	Если Результат = КодВозвратаДиалога.Да Тогда
		ВыполнитьУдалениеСервер();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьСписокСправочников()
	
	ВозвращаемыйСписок = Новый СписокЗначений;
	
	Для Каждого Строка Из Метаданные.Справочники Цикл 
		ВозвращаемыйСписок.Добавить(Строка.Имя, Строка.Синоним);
	КонецЦикла;
	
	Возврат ВозвращаемыйСписок;
	
КонецФункции

&НаСервере
Функция ПолучитьКоличествоУдаляемыхЭлементов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВерсииОбъектов.Объект,
		|	ВерсииОбъектов.НомерВерсии
		|ИЗ
		|	РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
		|ГДЕ
		|	ВерсииОбъектов.ДатаВерсии >= &ДатаНач
		|	И ВерсииОбъектов.ДатаВерсии <= &ДатаКон";
		
		Если ЗначениеЗаполнено(Объект.ИмяСправочника) Тогда
			Запрос.Текст = Запрос.Текст + "
			|	И ВерсииОбъектов.Объект В
			|			(ВЫБРАТЬ
			|				нсиОбщСправочник.Ссылка
			|			ИЗ
			|				Справочник." + Объект.ИмяСправочника + " КАК нсиОбщСправочник)";
		КонецЕсли;

	
	Запрос.УстановитьПараметр("ДатаНач", Объект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", Объект.Период.ДатаОкончания);

	Результат = Запрос.Выполнить().Выбрать();

	Возврат Результат.Количество();
	
КонецФункции

&НаСервере
Процедура ВыполнитьУдалениеСервер()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВерсииОбъектов.Объект,
		|	ВерсииОбъектов.НомерВерсии
		|ИЗ
		|	РегистрСведений.ВерсииОбъектов КАК ВерсииОбъектов
		|ГДЕ
		|	ВерсииОбъектов.ДатаВерсии >= &ДатаНач
		|	И ВерсииОбъектов.ДатаВерсии <= &ДатаКон";
		
		Если ЗначениеЗаполнено(Объект.ИмяСправочника) Тогда
			Запрос.Текст = Запрос.Текст + "
			|	И ВерсииОбъектов.Объект В
			|			(ВЫБРАТЬ
			|				нсиОбщСправочник.Ссылка
			|			ИЗ
			|				Справочник." + Объект.ИмяСправочника + " КАК нсиОбщСправочник)";
		КонецЕсли;

	
	Запрос.УстановитьПараметр("ДатаНач", Объект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", Объект.Период.ДатаОкончания);

	Результат = Запрос.Выполнить().Выбрать();

	КоличествоУдаляемыхЗаписей = Результат.Количество();
	
	Пока Результат.Следующий() Цикл
		НаборЗаписей = РегистрыСведений.ВерсииОбъектов.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(Результат.Объект);
		НаборЗаписей.Отбор.НомерВерсии.Установить(Результат.НомерВерсии);
		НаборЗаписей.Записать();
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Удалено " + Строка(КоличествоУдаляемыхЗаписей) + " записей.");

КонецПроцедуры

#КонецОбласти
